PH_data/alpha_0.6/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
12225
(
( -0.001809373265 -0.001638978603 -0.0005022294354 )
( -0.002598925959 -0.001462609856 -0.0005225398345 )
( -0.001622925745 -0.001647969475 -0.0004935967154 )
( -0.002989385743 -0.001367707388 -0.0005200862652 )
( -0.002409375506 -0.0014697765 -0.0005083538708 )
( -0.001348314807 -0.001672780258 -0.000471082225 )
( -0.003675446846 -0.001179635758 -0.0004980924423 )
( -0.002793977968 -0.001372644212 -0.0005052697961 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
